'''Написать программу, которая:

Создаёт случайный список из **20** значений по **4** случайных целых чисел от **-10** до **10**.
Находит все уникальные комбинации пар из этих значений и выводит их в виде списка кортежей.
Пользователь вводит целое число.
 Вычисляет количество пар, чья сумма меньше заданного пользователем значения.'''
import random#подключение модуля random
list_num=[(random.randint(-10,10),random.randint(-10,10),random.randint(-10,10),random.randint(-10,10)) for i in range(1,20+1)]#cоздаем список из 20 кортежей, каждый из которых содержит 4 случайных целых числа от -10 до 10
print (list_num) #вывод на консоль
unique_pairs=set() # Создаем множество для хранения уникальных пар кортежей
print(list_num)# вывод на консоль       
uniq_pairs=set()#создаем множество для уникальных пар

for i in range(len(list_num)):#используем цикл for для создания уникальных пар
    for j in range(i + 1, len(list_num)):#
        uniq_pairs.add((list_num[i], list_num[j]))#

print("Уникальные пары:") #вывод уникальных пар на консоль 

for pair in uniq_pairs: #проходимся с помощью цикла по каждой уникальной паре 
    print(pair) #вывод на консоль

count_p=0#переменная для подсчета количества уникальных пар

user_num =int(input("введите целое число: "))#ввод числа с клавиатуры
for pair in uniq_pairs: # проходим с помощью цикла по всем уникальным парам
    sum_pair = sum(pair[0]) + sum(pair[1]) #вычисляем сумму в паре
    if sum_pair < user_num: #проверяем условие, если сумма меньше, числа user_num
        count_p += 1 # к переменной count добавляем 1

print(f"Количество пар, чья сумма меньше {user_num}: {count_p}")#вывод результата на консоль
